import eel

# Инициализация папки web
eel.init('Client/web')

#***************************************************************************************************************
# Класс для работы с БД
class Data():
    def __init__(self):
        pass

    # Функции которые можно будет вызывать через объект класса из js 
    @eel.expose
    def Check_db():
        pass

    @eel.expose
    def Create_db():
        pass

    @eel.expose
    def Get_data():
        return 'adfdgzdg'

    @eel.expose
    def Add_data():
        pass

# Объект класса через который можно будет обращатся к классу из js 
data_keeper = Data()


#***************************************************************************************************************
# Подключение к серверу и получение от него данных



#***************************************************************************************************************
# 


#***************************************************************************************************************
# Запускаем Eel
eel.start(
    'Begin.html',
    size=(800, 600),  # Указываем размер окна
)

# pyinstaller --noconfirm --onefile --noconsole --add-data "web;web" --add-data "d:/Dev/axaxa/.venv/lib/site-packages/eel/eel.js;eel" App.py
